#Книжные магазины предлагают следующие коллекции книг.
#Магистр – Лермонтов, Достоевский, Пушкин, Тютчев
#ДомКниги – Толстой, Грибоедов, Чехов, Пушкин.
#БукМаркет – Пушкин, Достоевский, Маяковский.
#Галерея – Чехов, Тютчев, Пушкин.
#Определить в каких магазинах
#можно приобрести книги Маяковского

magistr = ('Лермонтов', 'Достоевский', 'Пушкин', 'Тютчев',)
domknig = ('Толстой', 'Грибоедов', 'Чехов', 'Пушкин')
bykmarket = ('Пушкин', 'Достоевский', 'Маяковский')
galereya = ('Чехов', 'Тютчев', 'Пушкин')
if 'Маяковский' in bykmarket:
    print('Книги Маяковского можно купить в БукМаркете')

