#Найти сумму чисел ряда 1,2,3,...,60 с использованием функции нахождения суммы. Использовать локальные переменные
def summa():
    list = range(1, 61)
    a = sum(list)
    print(a)
summa()